In [3]:
import pandahouse as ph # библиотека для работы с SQL в питоне
import pandas as pd

In [4]:
connection_default = {'host':'https://clickhouse.lab.karpov.courses', # подключаемся к аккаунту обычному
                     'database':'default',
                     'user':'student',
                     'password':'dpo_python_2020'}

connection_test = dict(host = 'https://clickhouse.lab.karpov.courses', # подключаемся к аккаунту с правами на редактирование с создание таблиц
                       database = 'test',
                       user = 'student-rw',
                       password = '656e2b0c9c')

In [6]:
q_read = '''
    SELECT *
    FROM {db}.checks 
    LIMIT 10
    '''
# db автоматически заменится за значение database

q_test = ph.read_clickhouse(query = q_read, connection = connection_default)# отправляем запрос по выбранному соеденению и записываем его в пандасовский датафрейм
q_test # выводим созданный датафрейм

   Rub     BuyDate                UserID
0    3  2019-10-04  18446583642950580515
1    4  2019-10-04  18446535622689003675
2    0  2019-10-04  18446130411954852964
3    3  2019-10-04  18446003252714243011
4    8  2019-10-04  18445948434655311802
5   17  2019-10-04  18445927732647659917
6    2  2019-10-04  18445761122620052505
7   15  2019-10-04  18445655133428855896
8    1  2019-10-04  18445587876544434519
9    1  2019-10-04  18445586451093345117

In [16]:
q_create = '''
    CREATE TABLE test.example_table_mary (
        Rub UInt32,
        BuyDate String,
        UserID UInt32
    ) 
    ENGINE = MergeTree 
    ORDER BY (Rub, BuyDate)
    '''
# создаём таблицу через второй аккаунт

ph.execute(query = q_create, connection = connection_test) 
# отправляем запрос по выбранному соеденению. (b'') - видимо, код удачной операции:)

b''

In [17]:
df_in = q_test
ph.to_clickhouse(df_in, 'example_table_mary', index = False, connection = connection_test)
# записываем данные из пандаса в кликхаус в уже созданную таблицу 
# в аутпуте покажется количество записанных строк

10

In [18]:
# проверяем, что всё записалось
query_test = '''
    SELECT *
    FROM test.example_table_mary
    LIMIT 100
    '''
df_new = ph.read_clickhouse(query_test, connection = connection_test)
df_new

   Rub     BuyDate      UserID
0    0  2019-10-04  3172553828
1    1  2019-10-04  3735998807
2    1  2019-10-04  4214051677
3    2  2019-10-04  3715798041
4    3  2019-10-04  3449403683
5    3  2019-10-04   733709251
6    4  2019-10-04   922196123
7    8  2019-10-04  3637344186
8   15  2019-10-04  1432564824
9   17  2019-10-04  3372059021